html/elisp/introduction/data_type/string.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>字符串</title>
<meta name="author" content="Wu, Shanliang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="data_type.html"> UP </a>
 |
 <a accesskey="H" href="../elisp.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">字符串</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc35116d">字符串</a></li>
<li><a href="#org48842e9">字符</a></li>
<li><a href="#orgd18208e">测试</a></li>
<li><a href="#orgf2a45bf">构造</a></li>
<li><a href="#org7f7ce43">比较</a></li>
<li><a href="#org3c0262a">转换</a></li>
<li><a href="#orge8fa3dd">格式化</a></li>
<li><a href="#org629558d">查找和替换</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc35116d" class="outline-2">
<h2 id="orgc35116d">字符串</h2>
<div class="outline-text-2" id="text-orgc35116d">
<p>
在 emacs 里字符串是有序的字符数组，和 c 语言的字符串数组不同，emacs 的字符串可以容纳任何字符，包括 <span class="underline">\0</span> ： 
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>setq foo <span style="color: #ffa07a;">"abc\000abc"</span><span style="color: #696969;">)</span>                 <span style="color: #ff4500;">; =&gt; "abc^@abc"</span>
</pre>
</div>

<pre class="example" id="orgdadc35e">
关于字符串有很多高级的属性，例如字符串的表示有单字节和多字节类型，字符串可以有文本属性等等
</pre>
</div>
</div>

<div id="outline-container-org48842e9" class="outline-2">
<h2 id="org48842e9">字符</h2>
<div class="outline-text-2" id="text-org48842e9">
<p>
首先构成字符串的字符其实就是一个整数
</p>
<pre class="example" id="org2d44a1f">
一个字符 'A' 就是一个整数 65

但是目前字符串中的字符被限制在 0-524287 之间
</pre>
<p>
字符的读入语法是在字符前加上一个问号，比如 ?A 代表字符 'A'
</p>

<div class="org-src-container">
<pre class="src src-lisp">?A                                      <span style="color: #ff4500;">; =&gt; 65</span>
?a                                      <span style="color: #ff4500;">; =&gt; 97</span>
</pre>
</div>

<ul class="org-ul">
<li>对于 <span class="underline">标点</span> 来说，也可以用同样的语法，但是最好在前面加上转义字符 <span class="underline">\</span> ，因为有些标点会有岐义，比如 ?\(
<ul class="org-ul">
<li>\ 必须用 ?\\ 表示</li>
</ul></li>
<li><p>
控制字符，退格、制表符，换行符，垂直制表符，换页符，空格，回车，删除和 escape 表示为 ?\a, ?\b, ?\t, ?\n, ?\v, ?\f, ?\s, ?\r, ?\d, 和 ?\e
</p>

<div class="org-src-container">
<pre class="src src-lisp">
?\a =&gt; 7                 <span style="color: #ff4500;">; control-g, `</span><span style="color: #7fffd4;">C-g</span><span style="color: #ff4500;">'</span>
?\b =&gt; 8                 <span style="color: #ff4500;">; backspace, &lt;BS&gt;, `</span><span style="color: #7fffd4;">C-h</span><span style="color: #ff4500;">'</span>
?\t =&gt; 9                 <span style="color: #ff4500;">; tab, &lt;TAB&gt;, `</span><span style="color: #7fffd4;">C-i</span><span style="color: #ff4500;">'</span>
?\n =&gt; 10                <span style="color: #ff4500;">; newline, `</span><span style="color: #7fffd4;">C-j</span><span style="color: #ff4500;">'</span>
?\v =&gt; 11                <span style="color: #ff4500;">; vertical tab, `</span><span style="color: #7fffd4;">C-k</span><span style="color: #ff4500;">'</span>
?\f =&gt; 12                <span style="color: #ff4500;">; formfeed character, `</span><span style="color: #7fffd4;">C-l</span><span style="color: #ff4500;">'</span>
?\r =&gt; 13                <span style="color: #ff4500;">; carriage return, &lt;RET&gt;, `</span><span style="color: #7fffd4;">C-m</span><span style="color: #ff4500;">'</span>
?\e =&gt; 27                <span style="color: #ff4500;">; escape character, &lt;ESC&gt;, `</span><span style="color: #7fffd4;">C-[</span><span style="color: #ff4500;">'</span>
?\s =&gt; 32                <span style="color: #ff4500;">; space character, &lt;SPC&gt;</span>
?\\ =&gt; 92                <span style="color: #ff4500;">; backslash character, `\'</span>
?\d =&gt; 127               <span style="color: #ff4500;">; delete character, &lt;DEL&gt;</span>
</pre>
</div>

<pre class="example" id="org8f1fe63">
没有特殊意义的字符，加上转义字符 \ 是没有副作用的，比如 ?\+ 和 ?+ 是完全一样的

所以标点还是都用转义字符来表示吧 
</pre>

<p>
<span class="underline">控制字符</span> 可以有多种表示方式，比如 C-i，这些都是对的，它们都对应数字 9：
</p>

<div class="org-src-container">
<pre class="src src-lisp">?\^I
?\^i
?\C-I
?\C-i 
</pre>
</div>
<p>
<span class="underline">meta 字符</span> 是用 <span class="underline">修饰键</span> （通常就是 Alt 键）输入的字符。之所以称为修饰键，是因为这样输入的字符就是在其修饰字符的第 <b>27</b> 位由 0 变成 1 而成，也就是如下操作：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>logior <span style="color: #696969;">(</span>lsh 1 27<span style="color: #696969;">)</span> ?A<span style="color: #696969;">)</span>                  <span style="color: #ff4500;">; =&gt; 134217793</span>
?\M-A                                   <span style="color: #ff4500;">; =&gt; 134217793</span>
</pre>
</div>
<p>
可以用 <span class="underline">\M-</span> 代表 meta 键，加上修饰的字符就是新生成的字符。比如：?\M-A, ?\M-\C-b. 后面这个也可以写成 ?\C-\M-b。
</p>

<pre class="example" id="org3728038">
如果还记得前面说过字符串里的字符不能超过 524287 的话，这就可以看出字符串是不能放下一个 meta 字符的，所以按键序列在这时只能用 vector 来储存
</pre>

<p>
其它的修饰键也是类似的，emacs 用 ：
</p>
<ul class="org-ul">
<li>第 25 位来表示 shift 键</li>
<li>第 24 对应 hyper</li>
<li>第 23 对应 super</li>
<li>第 22 对应 alt</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd18208e" class="outline-2">
<h2 id="orgd18208e">测试</h2>
<div class="outline-text-2" id="text-orgd18208e">
<ul class="org-ul">
<li>字符串测试使用 <span class="underline">stringp</span> ，没有 charp，因为字符就是整数</li>
<li><span class="underline">string-or-null-p</span> 当对象是一个字符或 nil 时返回 t</li>
<li><p>
<span class="underline">char-or-string-p</span> 测试是否是字符串或者字符类型
</p>

<pre class="example" id="orgcd808a1">
比较头疼的是 emacs 没有测试字符串是否为空的函数
</pre>
<p>
这是我用的这个测试函数，使用前要测试字符串是否为 nil：
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">string-emptyp</span> <span style="color: #696969;">(</span>str<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>string&lt; <span style="color: #ffa07a;">""</span> str<span style="color: #696969;">)))</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgf2a45bf" class="outline-2">
<h2 id="orgf2a45bf">构造</h2>
<div class="outline-text-2" id="text-orgf2a45bf">
<ul class="org-ul">
<li>产生一个字符串可以用 <span class="underline">make-string</span> 。这样生成的字符串包含的字符都是一样的</li>
<li><p>
要生成不同的字符串可以用 <span class="underline">string</span> 函数 
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>make-string 5 ?x<span style="color: #696969;">)</span>                      <span style="color: #ff4500;">; =&gt; "xxxxx"</span>
<span style="color: #696969;">(</span>string ?a ?b ?c<span style="color: #696969;">)</span>                       <span style="color: #ff4500;">; =&gt; "abc"</span>
</pre>
</div>

<p>
在已有的字符串生成新的字符串的方法有 <span class="underline">substring</span> , <span class="underline">concat</span> 
</p>
<ul class="org-ul">
<li>substring 的后两个参数是起点和终点的位置，如果终点越界或者终点比起点小都会产生一个错误。这个在使用 substring 时要特别小心</li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>substring <span style="color: #ffa07a;">"0123456789"</span> 3<span style="color: #696969;">)</span>              <span style="color: #ff4500;">; =&gt; "3456789"</span>
<span style="color: #696969;">(</span>substring <span style="color: #ffa07a;">"0123456789"</span> 3 5<span style="color: #696969;">)</span>            <span style="color: #ff4500;">; =&gt; "34"</span>
<span style="color: #696969;">(</span>substring <span style="color: #ffa07a;">"0123456789"</span> -3 -1<span style="color: #696969;">)</span>          <span style="color: #ff4500;">; =&gt; "78"</span>
</pre>
</div>

<p>
concat 函数相对简单，就是把几个字符串连接起来
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org7f7ce43" class="outline-2">
<h2 id="org7f7ce43">比较</h2>
<div class="outline-text-2" id="text-org7f7ce43">
<ul class="org-ul">
<li><p>
<span class="underline">char-equal</span> 可以比较两个字符是否相等。与整数比较不同，这个函数还考虑了大小写
</p>
<ul class="org-ul">
<li>如果 <span class="underline">case-fold-search</span> 变量是 t 时，这个函数的字符比较是忽略大小写的</li>
</ul>
<pre class="example" id="orge41a81d">
编程时要小心，因为通常 case-fold-search 都是 t，这样如果要考虑字符的大小写时就不能用 char-equal 函数了
</pre>
<ul class="org-ul">
<li>字符串比较使用 <span class="underline">string=</span> ，string-equal 是一个别名</li>
<li><span class="underline">string&lt;</span> 是按 <b>字典序</b> 比较两个字符串，string-less 是它的别名</li>
</ul>
<pre class="example" id="org1bdcc08">
空字符串小于所有字符串，除了空字符串，前面 string-emptyp 就是用这个特性

当然直接用 length 检测字符串长度应该也可以，还可以省去检测字符串是否为空
</pre>
<ul class="org-ul">
<li>没有 string&gt; 函数</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org3c0262a" class="outline-2">
<h2 id="org3c0262a">转换</h2>
<div class="outline-text-2" id="text-org3c0262a">
<ul class="org-ul">
<li>字符转换成字符串可以用 <span class="underline">char-to-string</span> 函数</li>
<li>字符串转换成字符可以用 <span class="underline">string-to-char</span>
<ul class="org-ul">
<li>当然只是返回字符串的第一个字符</li>
</ul></li>
<li>数字和字符串之间的转换：
<ul class="org-ul">
<li><span class="underline">string-to-number</span> 可以设置字符串的进制，可以从 2 到 16</li>
<li><span class="underline">number-to-string</span> 只能转换成 10 进制的数字</li>
</ul></li>
<li><p>
如果要输出八进制或者十六进制，可以用 <span class="underline">format</span> 函数：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>string-to-number <span style="color: #ffa07a;">"256"</span><span style="color: #696969;">)</span>                <span style="color: #ff4500;">; =&gt; 256</span>
<span style="color: #696969;">(</span>number-to-string 256<span style="color: #696969;">)</span>                  <span style="color: #ff4500;">; =&gt; "256"</span>
<span style="color: #696969;">(</span>format <span style="color: #ffa07a;">"%#o"</span> 256<span style="color: #696969;">)</span>                      <span style="color: #ff4500;">; =&gt; "0400"</span>
<span style="color: #696969;">(</span>format <span style="color: #ffa07a;">"%#x"</span> 256<span style="color: #696969;">)</span>                      <span style="color: #ff4500;">; =&gt; "0x100"</span>
</pre>
</div>

<p>
如果要输出成二进制，好像没有现成的函数了。calculator 库倒是可以，这是我写的函数：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">number-to-bin-string</span> <span style="color: #696969;">(</span>number<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">calculator</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00ffff;">let</span> <span style="color: #696969;">((</span>calculator-output-radix 'bin<span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span>calculator-radix-grouping-mode nil<span style="color: #696969;">))</span>
    <span style="color: #696969;">(</span>calculator-number-to-string number<span style="color: #696969;">)))</span>
<span style="color: #696969;">(</span>number-to-bin-string 256<span style="color: #696969;">)</span>              <span style="color: #ff4500;">; =&gt; "100000000"</span>
</pre>
</div>

<ul class="org-ul">
<li><span class="underline">concat</span> 可以把一个 <b>字符构成</b> 的 <span class="underline">列表或者向量</span> 转换成 <span class="underline">字符串</span></li>
<li><span class="underline">vconcat</span> 可以把一个 <span class="underline">字符串</span> 转换成一个 <span class="underline">向量</span></li>
<li><span class="underline">append</span> 可以把一个 <span class="underline">字符串</span> 转换成一个 <span class="underline">列表</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>concat '<span style="color: #696969;">(</span>?a ?b ?c ?d ?e<span style="color: #696969;">))</span>              <span style="color: #ff4500;">; =&gt; "abcde"</span>
<span style="color: #696969;">(</span>concat <span style="color: #696969;">[</span>?a ?b ?c ?d ?e<span style="color: #696969;">]</span><span style="color: #696969;">)</span>               <span style="color: #ff4500;">; =&gt; "abcde"</span>
<span style="color: #696969;">(</span>vconcat <span style="color: #ffa07a;">"abdef"</span><span style="color: #696969;">)</span>                       <span style="color: #ff4500;">; =&gt; [97 98 100 101 102]</span>
<span style="color: #696969;">(</span>append <span style="color: #ffa07a;">"abcdef"</span> nil<span style="color: #696969;">)</span>                   <span style="color: #ff4500;">; =&gt; (97 98 99 100 101 102)</span>
</pre>
</div>

<ul class="org-ul">
<li>大小写转换使用的是 <span class="underline">downcase</span> 和 <span class="underline">upcase</span> 两个函数
<ul class="org-ul">
<li>这两个函数的参数既可以字符串，也可以是字符</li>
</ul></li>
<li><span class="underline">capitalize</span> 可以使字符串中单词的 <b>第一个字符大写</b> ，其它字符小写
<ul class="org-ul">
<li><span class="underline">upcase-initials</span> 只使第一个单词的第一个字符大写，其它字符小写</li>
<li>这两个函数的参数如果是一个字符，那么只让这个字符大写</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>downcase <span style="color: #ffa07a;">"The cat in the hat"</span><span style="color: #696969;">)</span>         <span style="color: #ff4500;">; =&gt; "the cat in the hat"</span>
<span style="color: #696969;">(</span>downcase ?X<span style="color: #696969;">)</span>                           <span style="color: #ff4500;">; =&gt; 120</span>
<span style="color: #696969;">(</span>upcase <span style="color: #ffa07a;">"The cat in the hat"</span><span style="color: #696969;">)</span>           <span style="color: #ff4500;">; =&gt; "THE CAT IN THE HAT"</span>
<span style="color: #696969;">(</span>upcase ?x<span style="color: #696969;">)</span>                             <span style="color: #ff4500;">; =&gt; 88</span>
<span style="color: #696969;">(</span>capitalize <span style="color: #ffa07a;">"The CAT in tHe hat"</span><span style="color: #696969;">)</span>       <span style="color: #ff4500;">; =&gt; "The Cat In The Hat"</span>
<span style="color: #696969;">(</span>upcase-initials <span style="color: #ffa07a;">"The CAT in the hAt"</span><span style="color: #696969;">)</span>  <span style="color: #ff4500;">; =&gt; "The CAT In The HAt"</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orge8fa3dd" class="outline-2">
<h2 id="orge8fa3dd">格式化</h2>
<div class="outline-text-2" id="text-orge8fa3dd">
<p>
format 类似于 C 语言里的 printf 可以实现对象的字符串化，数字的格式化和 printf 的参数差不多
</p>
<ul class="org-ul">
<li>值得一提的是 <span class="underline">%S</span> 这个格式化形式，它可以把 <b>对象的输出形式</b> 转换成 <span class="underline">字符串</span> ，这在调试时是很有用的</li>
</ul>
</div>
</div>

<div id="outline-container-org629558d" class="outline-2">
<h2 id="org629558d">查找和替换</h2>
<div class="outline-text-2" id="text-org629558d">
<p>
字符串查找的核心函数是 <span class="underline">string-match</span> 。这个函数可以从 <span class="underline">指定的位置</span> 对字符串进行 <b>正则表达式匹配</b> ，如果匹配成功，则返回 <span class="underline">匹配的起点</span> ，如：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>string-match <span style="color: #ffa07a;">"34"</span> <span style="color: #ffa07a;">"01234567890123456789"</span><span style="color: #696969;">)</span>    <span style="color: #ff4500;">; =&gt; 3</span>
<span style="color: #696969;">(</span>string-match <span style="color: #ffa07a;">"34"</span> <span style="color: #ffa07a;">"01234567890123456789"</span> 10<span style="color: #696969;">)</span> <span style="color: #ff4500;">; =&gt; 13</span>
</pre>
</div>

<pre class="example" id="org6fec5c9">
注意 string-match 的参数是一个 regexp
</pre>
<p>
emacs 好象没有内建的查找子串的函数。如果想把 string-match 作为一个查找子串的函数，可以先用 <span class="underline">regexp-quote</span> 函数先处理一下子串。比如：
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span>string-match <span style="color: #ffa07a;">"2*"</span> <span style="color: #ffa07a;">"232*3=696"</span><span style="color: #696969;">)</span>                <span style="color: #ff4500;">; =&gt; 0</span>
<span style="color: #696969;">(</span>string-match <span style="color: #696969;">(</span>regexp-quote <span style="color: #ffa07a;">"2*"</span><span style="color: #696969;">)</span> <span style="color: #ffa07a;">"232*3=696"</span><span style="color: #696969;">)</span> <span style="color: #ff4500;">; =&gt; 2</span>
</pre>
</div>

<pre class="example" id="org92c911c">
事实上，string-match 不只是查找字符串，它更重要的功能是捕捉匹配的字符串

如果你对正则表达式不了解，可能需要先找一本书，先了解一下什么是正则表达式
</pre>
<p>
string-match 在查找的同时，还会 <b>记录</b> 下每个要 <b>捕捉</b> 的 <span class="underline">字符串的位置</span> 。这个位置可以在匹配后用 <span class="underline">match-data</span> 、 <span class="underline">match-beginning</span> 和 <span class="underline">match-end</span> 等函数来获得。先看一下例子：
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">progn</span>
  <span style="color: #696969;">(</span>string-match <span style="color: #ffa07a;">"3</span><span style="color: #ffa07a; font-weight: bold;">\\</span><span style="color: #ffa07a; font-weight: bold;">(</span><span style="color: #ffa07a;">4</span><span style="color: #ffa07a; font-weight: bold;">\\</span><span style="color: #ffa07a; font-weight: bold;">)</span><span style="color: #ffa07a;">"</span> <span style="color: #ffa07a;">"01234567890123456789"</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>match-data<span style="color: #696969;">))</span>                         <span style="color: #ff4500;">; </span><span style="color: #ff4500;">=&gt; (3 5 4 5)</span>
</pre>
</div>

<p>
正则表达式捕捉的字符串按 <span class="underline">括号的顺序</span> 对应一个 <span class="underline">序号</span> 
</p>
<ul class="org-ul">
<li>整个模式对应序号 0</li>
<li>第一个括号对应序号 1</li>
<li>第二个括号对应序号 2</li>
<li><p>
。。。以此类推
</p>

<pre class="example" id="orgcebd98b">
所以 3\(4\) 这个正则表达式中有序号 0 和 1，最后 match-data 返回的一系列数字对应的分别是要捕捉字符串的起点和终点位置

也就是说子串 "34" 起点从位置 3 开始，到位置 5 结束

而捕捉的字符串 "4" 的起点是从 4 开始，到 5 结束

这些位置可以用 match-beginning 和 match-end 函数用对应的序号得到
</pre>
<p>
注意：
</p>
<ul class="org-ul">
<li>起点位置：捕捉字符串的 <span class="underline">第一个字符的位置</span></li>
<li>终点位置：不是捕捉的字符串最后一个字符的位置，而是 <b>下一个字符的位置</b></li>
</ul>

<p>
这个性质对于循环是很方便的。比如要查找上面这个字符串中所有 34 出现的位置：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">let</span> <span style="color: #696969;">((</span>start 0<span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span><span style="color: #00ffff;">while</span> <span style="color: #696969;">(</span>string-match <span style="color: #ffa07a;">"34"</span> <span style="color: #ffa07a;">"01234567890123456789"</span> start<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span>princ <span style="color: #696969;">(</span>format <span style="color: #ffa07a;">"find at %d\n"</span> <span style="color: #696969;">(</span>match-beginning 0<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span>setq start <span style="color: #696969;">(</span>match-end 0<span style="color: #696969;">))))</span>

<span style="color: #ff4500;">;; </span><span style="color: #ff4500;">find at 3</span>
<span style="color: #ff4500;">;; </span><span style="color: #ff4500;">find at 13</span>
<span style="color: #ff4500;">;; </span><span style="color: #ff4500;">nil</span>
</pre>
</div></li>
</ul>


<p>
替换使用的函数是 <span class="underline">replace-match</span> 。这个函数既可以用于 <span class="underline">字符串</span> 的替换，也可以用于 <span class="underline">缓冲区的文本</span> 替换
</p>
<ul class="org-ul">
<li><p>
对于字符串的替换，replace-match 只是按 <span class="underline">给定的序号</span> 把字符串中的 <span class="underline">那一部分用提供的字符串</span> 替换了而已：
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #696969;">(</span><span style="color: #00ffff;">let</span> <span style="color: #696969;">((</span>str <span style="color: #ffa07a;">"01234567890123456789"</span><span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span>string-match <span style="color: #ffa07a;">"34"</span> str<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>princ <span style="color: #696969;">(</span>replace-match <span style="color: #ffa07a;">"x"</span> nil nil str 0<span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span>princ <span style="color: #ffa07a;">"\n"</span><span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>princ str<span style="color: #696969;">))</span>

<span style="color: #ff4500;">;; </span><span style="color: #ff4500;">012x567890123456789</span>
<span style="color: #ff4500;">;; </span><span style="color: #ff4500;">01234567890123456789"01234567890123456789" </span>
</pre>
</div>

<p>
可以看出 replace-match 返回的字符串是替换后的新字符串，原字符串被没有改变 
</p>

<pre class="example" id="orgb10d7f1">
如果怎样把上面这个字符串中所有的 34 都替换掉？

如果想就使用同一个字符串来存储，可能对于固定的字符串，这个还容易一些

如果不是的话，就要花一些脑筋了，因为替换之后，新的字符串下一个搜索起点的位置就不能用 (match-end 0) 给出来的位置了，而是要扣除替换的字符串和被替换的字符串长度的差值
</pre>
<ul class="org-ul">
<li>对 <span class="underline">字符串的替换</span> 有一个函数 <span class="underline">replace-regexp-in-string</span> ：把每次匹配部分之前的子串收集起来，最后再把所有字符串连接起来</li>
<li><p>
<span class="underline">单字符的替换</span> 有 <span class="underline">subst-char-in-string</span> 函数
</p>

<pre class="example" id="orgf387f64">
但是 emacs 没有类似 perl函数或者程序 tr 那样进行字符替换的函数，只能自己建表进行循环操作了
</pre></li>
</ul></li>
</ul>

<p>
<a href="list.html">Next：列表</a>
</p>

<p>
<a href="number.html">Previous：数字</a>
</p>

<p>
<a href="data_type.html">Top: 数据类型</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
